# World cities exercise - solution

The goal of this exercise is to practice a common workflow for analyzing large data sets by combining Pandas and SQLAlchemy. 

This exercise uses an edited version of the world cities dataset from maxmind:

    https://www.maxmind.com/en/free-world-cities-database

For simplicity, the original data has been cleaned by removing all rows
with missing values.

In [1]:
# Useful imports.
import pandas as pd
from sqlalchemy import create_engine, func, select, Column, Integer, MetaData, String, Table

In [2]:
# Remove any existing database created in previous runs of this notebook.
import os

if os.path.isfile('world_cities.db'):
    os.unlink('world_cities.db')

**Question 1**

Using SQL Alchemy, create a new table which contains population, country and city.
Use "sqlite:///world_cities.db" as the URI, to create an sqlite database in a local file.

The table should be called "cities" and have 3 columns: "country" of type `String`, "city" of type `String`, and "population", of type `Integer`.

In [3]:
db = create_engine("sqlite:///world_cities.db")
metadata = MetaData()

cities = Table("cities", metadata,
               Column("country", String),
               Column("city", String),
               Column("population", Integer))
metadata.create_all(db)

**Question 2**

Import the data from the file `world_cities.csv` into the newly created table.

To make things interesting, let's pretend that the CSV is so large that it does not fit into memory:

1. Use Pandas' `read_csv` function to read 10000 lines at the time from the CSV file (using the `chunksize` argument). Column 0 in the file corresponds to the index.
2. Iterate over all file chunks and
3. Store each resulting data frame to the table using the `to_sql` method. (Hint: Use `if_exists='append'` to append to the DB table, and `index=False` to prevent Pandas from trying to store the index, for which we did not create a column.)

In [4]:
reader = pd.read_csv('world_cities.csv',  chunksize=10000, index_col=0)
for table in reader:
    table.to_sql('cities', db, if_exists='append', index=False)

**Question 3**

Using SQLAlchemy only, count how many rows are stored in the cities table. (There should be 47979 of them.)

In [5]:
s = select([cities.c.city]).count()
with db.connect() as conn:
    print 'Number of rows:', conn.execute(s).scalar()

Number of rows: 47979

**Question 4**

What are the cities with a population above 5 millions people?

Using SQLAlchemy, create an appropriate SQL query. Execute the query and create a DataFrame using Pandas' `read_sql` function.

Bonus: Change your query to get a dataframe sorted by the population, ideally in descending order.

In [6]:
s = select([cities]).where(cities.c.population > 5e6).order_by(cities.c.population.desc())
df = pd.read_sql(s, db)
df

   country            city  population
0       jp           tokyo    31480498
1       cn        shanghai    14608512
2       in          bombay    12692717
3       pk         karachi    11627378
4       in           delhi    10928270
5       in       new delhi    10928270
6       ph          manila    10443877
7       ru          moscow    10381288
8       kr           seoul    10323448
9       br       sao paulo    10021437
10      tr        istanbul     9797536
11      ng           lagos     8789133
12      mx          mexico     8720916
13      id         jakarta     8540306
14      us        new york     8107916
15      cd        kinshasa     7787832
16      eg           cairo     7734602
17      pe            lima     7646786
18      cn          peking     7480601
19      gb          london     7421228
20      co          bogota     7102602
21      bd           dhaka     6493177
22      pk          lahore     6312576
23      br  rio de janeiro     6023742
24      iq         baghdad     5672516
25      th         bangkok     5104475

**Question 5**

Compute the number of cities per country: create a "group by" query using SQLAlchemy, and import the result in Pandas.

Bonus: time the execution of that approach and compare with loading all data into a pandas `DataFrame` and doing the same operation there.

In [7]:
s = select([func.count(cities.c.city), cities.c.country]).group_by(cities.c.country)
pd.read_sql(s, db)

     count_1 country
0          7      ad
1          3      ae
2         57      af
3          8      ag
4          1      ai
5         66      al
6        287      am
7         14      an
8         32      ao
9         84      ar
10       221      at
11       187      au
12         1      aw
13        85      az
14       210      ba
15         9      bb
16        84      bd
17       503      be
18        45      bf
19       203      bg
20         2      bh
21        17      bi
22        28      bj
23         2      bm
24       107      bo
25      2017      br
26        19      bs
27        18      bt
28        74      bw
29        28      by
..       ...     ...
179       36      td
180        1      tf
181       20      tg
182      254      th
183       56      tj
184       18      tm
185       63      tn
186        4      to
187      262      tr
188       18      tt
189        4      tv
190       85      tw
191      270      tz
192      826      ua
193       81      ug
194     4175      us
195       36      uy
196       60      uz
197        8      vc
198       98      ve
199        3      vg
200       65      vn
201        6      vu
202       15      wf
203      137      ws
204        8      ye
205       13      yt
206      198      za
207       68      zm
208       28      zw

[209 rows x 2 columns]

In [8]:
# Here, we do something a bit more complicated as we order by a label, and only
# count cities > 1'000'000 inhabitants
s = (
    select([func.count(cities.c.city).label("count"), cities.c.country]).
    group_by(cities.c.country).
    where(cities.c.population > 1e6).
    order_by("count")
)
pd.read_sql(s, db)

    count country
0       1      ae
1       1      af
2       1      am
3       1      ao
4       1      at
5       1      az
6       1      be
7       1      bf
8       1      bg
9       1      by
10      1      cg
11      1      ci
12      1      cl
13      1      cz
14      1      dk
15      1      do
16      1      dz
17      1      et
18      1      fr
19      1      gb
20      1      ge
21      1      gn
22      1      ht
23      1      hu
24      1      ie
25      1      iq
26      1      ke
27      1      kh
28      1      kr
29      1      kz
..    ...     ...
59      2      it
60      2      lb
61      2      mm
62      2      ph
63      2      sd
64      2      sy
65      2      ua
66      3      ca
67      3      de
68      3      eg
69      3      ma
70      3      sa
71      3      ve
72      3      vn
73      4      co
74      4      tw
75      5      au
76      5      za
77      6      ir
78      6      jp
79      6      tr
80      7      ng
81      8      pk
82      9      mx
83      9      us
84     10      id
85     12      ru
86     15      br
87     33      in
88     39      cn

[89 rows x 2 columns]

In [9]:
# Compare doing the computations on the DB, then importing the result in Pandas,
# with importing the whole dataset in Pandas and doing all operations in Pandas.

def sql_query():
    s = (
        select([func.count(cities.c.city).label("count"), cities.c.country]).
        group_by(cities.c.country).
        where(cities.c.population > 1e6).
        order_by("count")
    )
    return pd.read_sql(s, db)

def pandas_query():
    s = select([cities])
    df = pd.read_sql(s, db)
    return df[df.population > 1e6].groupby('country').size().order()

In [10]:
%timeit sql_query()

100 loops, best of 3: 17.4 ms per loop

In [11]:
%timeit pandas_query()

10 loops, best of 3: 149 ms per loop